## Задача №1
(код с результатом)
Вывести отсортированный в алфавитном порядке список имен пользователей в файле passwd (вам понадобится grep).

![image](https://github.com/user-attachments/assets/1a9221ef-fb4e-4a47-bb25-138604251822)

КУ | Практика 1 | Задание 1 |

## Задача №2
(код с результатом)
Вывести данные /etc/protocols в отформатированном и отсортированном порядке для 5 наибольших портов, как показано в примере ниже:

![image](https://github.com/user-attachments/assets/2ae9bab2-2539-478a-873b-b08afd4b582e)

КУ | Практика 1 | Задание 2 |

## Задача №3
Написать программу banner средствами bash для вывода текстов, как в следующем примере (размер баннера должен меняться!) Рассмотрим код:

![image](https://github.com/user-attachments/assets/94c3a090-9247-42e8-9801-6ecfc58608e2)
